eks/kustomize/loadtest/logs/benchmark/deployment-control/avg-load-30m/rolling/avg-load-roll-1_1.log


  █ TOTAL RESULTS 

    checks_total.......: 6479682 3599.803376/s
    checks_succeeded...: 66.66%  4319788 out of 6479682
    checks_failed......: 33.33%  2159894 out of 6479682

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  93% — ✓ 1014528 / ✗ 65419
    ✗ shop version canary
      ↳  6% — ✓ 65419 / ✗ 1014528
    ✓ transaction service response status is 200
    ✗ transaction version stable
      ↳  93% — ✓ 1011009 / ✗ 68938
    ✗ transaction version canary
      ↳  6% — ✓ 68938 / ✗ 1011009

    CUSTOM
    shop_version_count.................: 1079947 599.967229/s
    shop_version_distribution..........: 100.00% 1079947 out of 1079947
    transaction_version_count..........: 1079947 599.967229/s
    transaction_version_distribution...: 100.00% 1079947 out of 1079947

    HTTP
    http_req_blocked...................: avg=4.12µs  min=898ns    med=2.61µs  max=52.82ms  p(90)=4.36µs  p(95)=4.93µs  
    http_req_connecting................: avg=282ns   min=0s       med=0s      max=52.44ms  p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=1.87ms  min=889.62µs med=1.19ms  max=331.78ms p(90)=2.04ms  p(95)=3.51ms  
      { expected_response:true }.......: avg=1.87ms  min=889.62µs med=1.19ms  max=331.78ms p(90)=2.04ms  p(95)=3.51ms  
    http_req_failed....................: 0.00%   0 out of 2159894
    http_req_receiving.................: avg=47.58µs min=4.63µs   med=24.56µs max=61.01ms  p(90)=91.05µs p(95)=131.57µs
    http_req_sending...................: avg=15.53µs min=2.76µs   med=7.33µs  max=106.47ms p(90)=16.68µs p(95)=25.47µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=1.81ms  min=872.84µs med=1.14ms  max=277.49ms p(90)=1.95ms  p(95)=3.39ms  
    http_reqs..........................: 2159894 1199.934459/s

    EXECUTION
    dropped_iterations.................: 54      0.03/s
    iteration_duration.................: avg=3.97ms  min=1.93ms   med=2.66ms  max=333.27ms p(90)=4.85ms  p(95)=8.59ms  
    iterations.........................: 1079947 599.967229/s
    vus................................: 8       min=0                  max=51
    vus_max............................: 74      min=38                 max=74

    NETWORK
    data_received......................: 259 MB  144 kB/s
    data_sent..........................: 216 MB  120 kB/s


  █ SCENARIO: baseline_load 

    checks_total.......: 6479682 3599.803376/s
    checks_succeeded...: 66.66%  4319788 out of 6479682
    checks_failed......: 33.33%  2159894 out of 6479682

    ✓ shop service response status is 200
    ✗ shop version stable
      ↳  93% — ✓ 1014528 / ✗ 65419
    ✗ shop version canary
      ↳  6% — ✓ 65419 / ✗ 1014528
    ✓ transaction service response status is 200
    ✗ transaction version stable
      ↳  93% — ✓ 1011009 / ✗ 68938
    ✗ transaction version canary
      ↳  6% — ✓ 68938 / ✗ 1011009

    CUSTOM
    shop_version_count.................: 1079947 599.967229/s
    shop_version_distribution..........: 100.00% 1079947 out of 1079947
    transaction_version_count..........: 1079947 599.967229/s
    transaction_version_distribution...: 100.00% 1079947 out of 1079947

    HTTP
    http_req_blocked...................: avg=4.12µs  min=898ns    med=2.61µs  max=52.82ms  p(90)=4.36µs  p(95)=4.93µs  
    http_req_connecting................: avg=282ns   min=0s       med=0s      max=52.44ms  p(90)=0s      p(95)=0s      
    http_req_duration..................: avg=1.87ms  min=889.62µs med=1.19ms  max=331.78ms p(90)=2.04ms  p(95)=3.51ms  
    http_req_failed....................: 0.00%   0 out of 2159894
    http_req_receiving.................: avg=47.58µs min=4.63µs   med=24.56µs max=61.01ms  p(90)=91.05µs p(95)=131.57µs
    http_req_sending...................: avg=15.53µs min=2.76µs   med=7.33µs  max=106.47ms p(90)=16.68µs p(95)=25.47µs 
    http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
    http_req_waiting...................: avg=1.81ms  min=872.84µs med=1.14ms  max=277.49ms p(90)=1.95ms  p(95)=3.39ms  
    http_reqs..........................: 2159894 1199.934459/s

    EXECUTION
    dropped_iterations.................: 54      0.03/s
    iteration_duration.................: avg=3.97ms  min=1.93ms   med=2.66ms  max=333.27ms p(90)=4.85ms  p(95)=8.59ms  
    iterations.........................: 1079947 599.967229/s

    NETWORK
    data_received......................: 259 MB  144 kB/s
    data_sent..........................: 216 MB  120 kB/s

    ↳ GROUP: shop 

      checks_total.......: 3239841 1799.901688/s
      checks_succeeded...: 66.66%  2159894 out of 3239841
      checks_failed......: 33.33%  1079947 out of 3239841

      ✓ shop service response status is 200
      ✗ shop version stable
          ↳  93% — ✓ 1014528 / ✗ 65419
      ✗ shop version canary
          ↳  6% — ✓ 65419 / ✗ 1014528

      CUSTOM
      shop_version_count..........: 1079947 599.967229/s
      shop_version_distribution...: 100.00% 1079947 out of 1079947

      HTTP
      http_req_blocked............: avg=4.89µs  min=1.23µs   med=3.06µs  max=48.67ms  p(90)=4.76µs  p(95)=5.35µs  
      http_req_connecting.........: avg=289ns   min=0s       med=0s      max=48.5ms   p(90)=0s      p(95)=0s      
      http_req_duration...........: avg=1.92ms  min=889.62µs med=1.2ms   max=331.78ms p(90)=2.12ms  p(95)=3.71ms  
      http_req_failed.............: 0.00%   0 out of 1079947
      http_req_receiving..........: avg=49µs    min=4.66µs   med=25.52µs max=61.01ms  p(90)=93.23µs p(95)=131.77µs
      http_req_sending............: avg=15.87µs min=2.76µs   med=8.08µs  max=106.47ms p(90)=17.48µs p(95)=23.44µs 
      http_req_tls_handshaking....: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
      http_req_waiting............: avg=1.85ms  min=877.38µs med=1.14ms  max=277.49ms p(90)=2.04ms  p(95)=3.59ms  
      http_reqs...................: 1079947 599.967229/s

    ↳ GROUP: transaction 

      checks_total.......: 3239841 1799.901688/s
      checks_succeeded...: 66.66%  2159894 out of 3239841
      checks_failed......: 33.33%  1079947 out of 3239841

      ✓ transaction service response status is 200
      ✗ transaction version stable
          ↳  93% — ✓ 1011009 / ✗ 68938
      ✗ transaction version canary
          ↳  6% — ✓ 68938 / ✗ 1011009

      CUSTOM
      transaction_version_count..........: 1079947 599.967229/s
      transaction_version_distribution...: 100.00% 1079947 out of 1079947

      HTTP
      http_req_blocked...................: avg=3.35µs  min=898ns    med=2.14µs  max=52.82ms  p(90)=3.16µs  p(95)=3.56µs  
      http_req_connecting................: avg=276ns   min=0s       med=0s      max=52.44ms  p(90)=0s      p(95)=0s      
      http_req_duration..................: avg=1.82ms  min=892.13µs med=1.19ms  max=236.13ms p(90)=1.96ms  p(95)=3.29ms  
      http_req_failed....................: 0.00%   0 out of 1079947
      http_req_receiving.................: avg=46.16µs min=4.63µs   med=23.55µs max=42.96ms  p(90)=88.62µs p(95)=131.35µs
      http_req_sending...................: avg=15.19µs min=2.98µs   med=6.73µs  max=92.32ms  p(90)=15.72µs p(95)=29.74µs 
      http_req_tls_handshaking...........: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
      http_req_waiting...................: avg=1.76ms  min=872.84µs med=1.14ms  max=236.1ms  p(90)=1.86ms  p(95)=3.17ms  
      http_reqs..........................: 1079947 599.967229/s